

let handler = async (m, { command, text }) => m.reply(`

املئ الاستمـ📜ـارة :

◞🔴 مملكة ANIME GANG┆🥇🏆 🔴◜
‏⎔ ٠ ┈─ ━╼ •﹝🔴﹞• ╾━ ─┈‏ ٠ ⎔
🔴╎اسـتـمـارة الـدخـول للاساسي هنا استقبال فقط ˼‏✨˹
✺‏ ⋅ ┄┄┄┉ •﹝🔴﹞• ┉┄┄┄ ⋅ ✺
=====هل [بنت او ولد]✓:[ ]
 

⌬╎اختر الـلـقـب من شخصيات انمي: ↯
> ⇜ ا』

⌬╎من اي انـمـي لقبك  ↯
> ⇜ ا』

⌬╎مـن ويـن جـبـت الـرابط:↯
> ⇜ ا』

⌬╎صورة الشخصية اللي هي لقبك : ↯
> ⇜ ا』
✺‏ ⋅ ┄┄┄┉ •﹝🔴﹞• ┉┄┄┄ ⋅ ✺
֎╎◞ ممنوع اختيار الولد لقب بنت و العكس صحيح 🤍◜
✺‏ ⋅ ┄┄┄┉ •﹝🔴﹞• ┉┄┄┄ ⋅ ✺
◞ANIME GANG
حـيـث تجـتـمـع الـسـلـطـة والعدالة 🔴◜
لما تكمل التسجيل منش اي مشرف
`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['استماره <teks>?']
handler.tags = ['استماره', 'fun']
handler.command = /^(استماره)$/i

export default handler
