import fetch from 'node-fetch'
let handler = async (m, { usedPrefix, command }) => {
const str = `1. *سُورَةُ ٱلْفَاتِحَةِ*
الآيات: 7

2. *سُورَةُ البَقَرَةِ*
الآيات: 286

3. *سُورَةُ آلِ عِمۡرَانَ*
الآيات: 200

4. *سُورَةُ النِّسَاءِ*
الآيات: 176

5. *سُورَةُ المَائـِدَةِ*
الآيات: 120

6. *سُورَةُ الأَنۡعَامِ*
الآيات: 165

7. *سُورَةُ الأَعۡرَافِ*
الآيات: 206

8. *سُورَةُ الأَنفَالِ*
الآيات: 75

9. *سُورَةُ التَّوۡبَةِ*
الآيات: 129

10. *سُورَةُ يُونُسَ*
الآيات: 109

11. *سُورَةُ هُودٍ*
الآيات: 123

12. *سُورَةُ يُوسُفَ*
الآيات: 111

13. *سُورَةُ الرَّعۡدِ*
الآيات: 43

14. *سُورَةُ إِبۡرَاهِيمَ*
الآيات: 52

15. *سُورَةُ الحِجۡرِ*
الآيات: 99

16. *سُورَةُ النَّحۡلِ*
الآيات: 128

17. *سُورَةُ الإِسۡرَاءِ*
الآيات: 111

18. *سُورَةُ الكَهۡفِ*
الآيات: 110

19. *سُورَةُ مَرۡيَمَ*
الآيات: 98

20. *سُورَةُ طه*
الآيات: 135

21. *سُورَةُ الأَنبِيَاءِ*
الآيات: 112

22. *سُورَةُ الحَجِّ*
الآيات: 78

23. *سُورَةُ المُؤۡمِنُونَ*
الآيات: 118

24. *سُورَةُ النُّورِ*
الآيات: 64

25. *سُورَةُ الفُرۡقَانِ*
الآيات: 77

26. *سُورَةُ الشُّعَرَاءِ*
الآيات: 227

27. *سُورَةُ النَّمۡلِ*
الآيات: 93

28. *سُورَةُ القَصَصِ*
الآيات: 88

29. *سُورَةُ العَنكَبُوتِ*
الآيات: 69

30. *سُورَةُ الرُّومِ*
الآيات: 60

31. *سُورَةُ لُقۡمَانَ*
الآيات: 34

32. *سُورَةُ السَّجۡدَةِ*
الآيات: 30

33. *سُورَةُ الأَحۡزَابِ*
الآيات: 73

34. *سُورَةُ سَبَإٍ*
الآيات: 54

35. *سُورَةُ فَاطِرٍ*
الآيات: 45

36. *سُورَةُ يسٓ*
الآيات: 83

37. *سُورَةُ الصَّافَّاتِ*
الآيات: 182

38. *سُورَةُ صٓ*
الآيات: 88

39. *سُورَةُ الزُّمَرِ*
الآيات: 75

40. *سُورَةُ غَافِرٍ*
الآيات: 85

41. *سُورَةُ فُصِّلَتۡ*
الآيات: 54

42. *سُورَةُ الشُّورَىٰ*
الآيات: 53

43. *سُورَةُ الزُّخۡرُفِ*
الآيات: 89

44. *سُورَةُ الدُّخَانِ*
الآيات: 59

45. *سُورَةُ الجَاثِيَةِ*
الآيات: 37

46. *سُورَةُ الأَحۡقَافِ*
الآيات: 35

47. *سُورَةُ مُحَمَّدٍ*
الآيات: 38

48. *سُورَةُ الفَتۡحِ*
الآيات: 29

49. *سُورَةُ الحُجُرَاتِ*
الآيات: 18

50. *سُورَةُ قٓ*
الآيات: 45

51. *سُورَةُ الذَّارِيَاتِ*
الآيات: 60

52. *سُورَةُ الطُّورِ*
الآيات: 49

53. *سُورَةُ النَّجۡمِ*
الآيات: 62

54. *سُورَةُ القَمَرِ*
الآيات: 55

55. *سُورَةُ الرَّحۡمَٰن*
الآيات: 78

56. *سُورَةُ الوَاقِعَةِ*
الآيات: 96

57. *سُورَةُ الحَدِيدِ*
الآيات: 29

58. *سُورَةُ المُجَادلَةِ*
الآيات: 22

59. *سُورَةُ الحَشۡرِ*
الآيات: 24

60. *سُورَةُ المُمۡتَحنَةِ*
الآيات: 13

61. *سُورَةُ الصَّفِّ*
الآيات: 14

62. *سُورَةُ الجُمُعَةِ*
الآيات: 11

63. *سُورَةُ المُنَافِقُونَ*
الآيات: 11

64. *سُورَةُ التَّغَابُنِ*
الآيات: 18

65. *سُورَةُ الطَّلَاقِ*
الآيات: 12

66. *سُورَةُ التَّحۡرِيمِ*
الآيات: 12

67. *سُورَةُ المُلۡكِ*
الآيات: 30

68. *سُورَةُ القَلَمِ*
الآيات: 52

69. *سُورَةُ الحَاقَّةِ*
الآيات: 52

70. *سُورَةُ المَعَارِجِ*
الآيات: 44

71. *سُورَةُ نُوحٍ*
الآيات: 28

72. *سُورَةُ الجِنِّ*
الآيات: 28

73. *سُورَةُ المُزَّمِّلِ*
الآيات: 20

74. *سُورَةُ المُدَّثِّرِ*
الآيات: 56

75. *سُورَةُ القِيَامَةِ*
الآيات: 40

76. *سُورَةُ الإِنسَانِ*
الآيات: 31

77. *سُورَةُ المُرۡسَلَاتِ*
الآيات: 50

78. *سُورَةُ النَّبَإِ*
الآيات: 40

79. *سُورَةُ النَّازِعَاتِ*
الآيات: 46

80. *سُورَةُ عَبَسَ*
الآيات: 42

81. *سُورَةُ التَّكۡوِيرِ*
الآيات: 29

82. *سُورَةُ الانفِطَارِ*
الآيات: 19

83. *سُورَةُ المُطَفِّفِينَ*
الآيات: 36

84. *سُورَةُ الانشِقَاقِ*
الآيات: 25

85. *سُورَةُ البُرُوجِ*
الآيات: 22

86. *سُورَةُ الطَّارِقِ*
الآيات: 17

87. *سُورَةُ الأَعۡلَىٰ*
الآيات: 19

88. *سُورَةُ الغَاشِيَةِ*
الآيات: 26

89. *سُورَةُ الفَجۡرِ*
الآيات: 30

90. *سُورَةُ البَلَدِ*
الآيات: 20

91. *سُورَةُ الشَّمۡسِ*
الآيات: 15

92. *سُورَةُ اللَّيۡلِ*
الآيات: 21

93. *سُورَةُ الضُّحَىٰ*
الآيات: 11

94. *سُورَةُ الشَّرۡحِ*
الآيات: 8

95. *سُورَةُ التِّينِ*
الآيات: 8

96. *سُورَةُ العَلَقِ*
الآيات: 19

97. *سُورَةُ القَدۡرِ*
الآيات: 5

98. *سُورَةُ البَيِّنَةِ*
الآيات: 8

99. *سُورَةُ الزَّلۡزَلَةِ*
الآيات: 8

100. *سُورَةُ العَادِيَاتِ*
الآيات: 11

101. *سُورَةُ القَارِعَةِ*
الآيات: 11

102. *سُورَةُ التَّكَاثُرِ*
الآيات: 8

103. *سُورَةُ العَصۡرِ*
الآيات: 3

104. *سُورَةُ الهُمَزَةِ*
الآيات: 9

105. *سُورَةُ الفِيلِ*
الآيات: 5

106. *سُورَةُ قُرَيۡشٍ*
الآيات: 4

107. *سُورَةُ المَاعُونِ*
الآيات: 7

108. *سُورَةُ الكَوۡثَرِ*
الآيات: 3

109. *سُورَةُ الكَافِرُونَ*
الآيات: 6

110. *سُورَةُ النَّصۡرِ*
الآيات: 3

111. *سُورَةُ المَسَدِ*
الآيات: 5

112. *سُورَةُ الإِخۡلَاصِ*
الآيات: 4

113. *سُورَةُ الفَلَقِ*
الآيات: 5

114. *سُورَةُ النَّاسِ*
الآيات: 6
`
  await m.reply(str)
}
handler.help = ['daftarsurah']
handler.tags = ['islam']
handler.command =['عدد-السور']
export default handler
